t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGINV register
//
//*************************************************************************************************
#define GPIO_GPGINV_GPIO198   0x40U         // Input inversion control for this pin
#define GPIO_GPGINV_GPIO199   0x80U         // Input inversion control for this pin
#define GPIO_GPGINV_GPIO200   0x100U        // Input inversion control for this pin
#define GPIO_GPGINV_GPIO201   0x200U        // Input inversion control for this pin
#define GPIO_GPGINV_GPIO202   0x400U        // Input inversion control for this pin
#define GPIO_GPGINV_GPIO203   0x800U        // Input inversion control for this pin
#define GPIO_GPGINV_GPIO204   0x1000U       // Input inversion control for this pin
#define GPIO_GPGINV_GPIO205   0x2000U       // Input inversion control for this pin
#define GPIO_GPGINV_GPIO206   0x4000U       // Input inversion control for this pin
#define GPIO_GPGINV_GPIO207   0x8000U       // Input inversion control for this pin
#define GPIO_GPGINV_GPIO208   0x10000U      // Input inversion control for this pin
#define GPIO_GPGINV_GPIO209   0x20000U      // Input inversion control for this pin
#define GPIO_GPGINV_GPIO210   0x40000U      // Input inversion control for this pin
#define GPIO_GPGINV_GPIO211   0x80000U      // Input inversion control for this pin
#define GPIO_GPGINV_GPIO212   0x100000U     // Input inversion control for this pin
#define GPIO_GPGINV_GPIO213   0x200000U     // Input inversion control for this pin
#define GPIO_GPGINV_GPIO214   0x400000U     // Input inversion control for this pin
#define GPIO_GPGINV_GPIO215   0x800000U     // Input inversion control for this pin
#define GPIO_GPGINV_GPIO216   0x1000000U    // Input inversion control for this pin
#define GPIO_GPGINV_GPIO217   0x2000000U    // Input inversion control for this pin
#define GPIO_GPGINV_GPIO218   0x4000000U    // Input inversion control for this pin
#define GPIO_GPGINV_GPIO219   0x8000000U    // Input inversion control for this pin
#define GPIO_GPGINV_GPIO220   0x10000000U   // Input inversion control for this pin
#define GPIO_GPGINV_GPIO221   0x20000000U   // Input inversion control for this pin
#define GPIO_GPGINV_GPIO222   0x40000000U   // Input inversion control for this pin
#define GPIO_GPGINV_GPIO223   0x80000000U   // Input inversion control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGODR register
//
//*************************************************************************************************
#define GPIO_GPGODR_GPIO198   0x40U         // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO199   0x80U         // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO200   0x100U        // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO201   0x200U        // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO202   0x400U        // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO203   0x800U        // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO204   0x1000U       // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO205   0x2000U       // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO206   0x4000U       // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO207   0x8000U       // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO208   0x10000U      // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO209   0x20000U      // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO210   0x40000U      // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO211   0x80000U      // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO212   0x100000U     // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO213   0x200000U     // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO214   0x400000U     // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO215   0x800000U     // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO216   0x1000000U    // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO217   0x2000000U    // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO218   0x4000000U    // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO219   0x8000000U    // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO220   0x10000000U   // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO221   0x20000000U   // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO222   0x40000000U   // Output Open-Drain control for this pin
#define GPIO_GPGODR_GPIO223   0x80000000U   // Output Open-Drain control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGAMSEL register
//
//*************************************************************************************************
#define GPIO_GPGAMSEL_GPIO198   0x40U         // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO199   0x80U         // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO200   0x100U        // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO201   0x200U        // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO202   0x400U        // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO203   0x800U        // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO204   0x1000U       // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO205   0x2000U       // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO206   0x4000U       // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO207   0x8000U       // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO208   0x10000U      // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO209   0x20000U      // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO210   0x40000U      // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO211   0x80000U      // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO212   0x100000U     // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO213   0x200000U     // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO214   0x400000U     // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO215   0x800000U     // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO216   0x1000000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO217   0x2000000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO218   0x4000000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO219   0x8000000U    // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO220   0x10000000U   // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO221   0x20000000U   // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO222   0x40000000U   // Analog Mode select for this pin
#define GPIO_GPGAMSEL_GPIO223   0x80000000U   // Analog Mode select for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGGMUX1 register
//
//*************************************************************************************************
#define GPIO_GPGGMUX1_GPIO198_S   12U
#define GPIO_GPGGMUX1_GPIO198_M   0x3000U       // Defines pin-muxing selection for GPIO198
#define GPIO_GPGGMUX1_GPIO199_S   14U
#define GPIO_GPGGMUX1_GPIO199_M   0xC000U       // Defines pin-muxing selection for GPIO199
#define GPIO_GPGGMUX1_GPIO200_S   16U
#define GPIO_GPGGMUX1_GPIO200_M   0x30000U      // Defines pin-muxing selection for GPIO200
#define GPIO_GPGGMUX1_GPIO201_S   18U
#define GPIO_GPGGMUX1_GPIO201_M   0xC0000U      // Defines pin-muxing selection for GPIO201
#define GPIO_GPGGMUX1_GPIO202_S   20U
#define GPIO_GPGGMUX1_GPIO202_M   0x300000U     // Defines pin-muxing selection for GPIO202
#define GPIO_GPGGMUX1_GPIO203_S   22U
#define GPIO_GPGGMUX1_GPIO203_M   0xC00000U     // Defines pin-muxing selection for GPIO203
#define GPIO_GPGGMUX1_GPIO204_S   24U
#define GPIO_GPGGMUX1_GPIO204_M   0x3000000U    // Defines pin-muxing selection for GPIO204
#define GPIO_GPGGMUX1_GPIO205_S   26U
#define GPIO_GPGGMUX1_GPIO205_M   0xC000000U    // Defines pin-muxing selection for GPIO205
#define GPIO_GPGGMUX1_GPIO206_S   28U
#define GPIO_GPGGMUX1_GPIO206_M   0x30000000U   // Defines pin-muxing selection for GPIO206
#define GPIO_GPGGMUX1_GPIO207_S   30U
#define GPIO_GPGGMUX1_GPIO207_M   0xC0000000U   // Defines pin-muxing selection for GPIO207

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGGMUX2 register
//
//*************************************************************************************************
#define GPIO_GPGGMUX2_GPIO208_S   0U
#define GPIO_GPGGMUX2_GPIO208_M   0x3U          // Defines pin-muxing selection for GPIO208
#define GPIO_GPGGMUX2_GPIO209_S   2U
#define GPIO_GPGGMUX2_GPIO209_M   0xCU          // Defines pin-muxing selection for GPIO209
#define GPIO_GPGGMUX2_GPIO210_S   4U
#define GPIO_GPGGMUX2_GPIO210_M   0x30U         // Defines pin-muxing selection for GPIO210
#define GPIO_GPGGMUX2_GPIO211_S   6U
#define GPIO_GPGGMUX2_GPIO211_M   0xC0U         // Defines pin-muxing selection for GPIO211
#define GPIO_GPGGMUX2_GPIO212_S   8U
#define GPIO_GPGGMUX2_GPIO212_M   0x300U        // Defines pin-muxing selection for GPIO212
#define GPIO_GPGGMUX2_GPIO213_S   10U
#define GPIO_GPGGMUX2_GPIO213_M   0xC00U        // Defines pin-muxing selection for GPIO213
#define GPIO_GPGGMUX2_GPIO214_S   12U
#define GPIO_GPGGMUX2_GPIO214_M   0x3000U       // Defines pin-muxing selection for GPIO214
#define GPIO_GPGGMUX2_GPIO215_S   14U
#define GPIO_GPGGMUX2_GPIO215_M   0xC000U       // Defines pin-muxing selection for GPIO215
#define GPIO_GPGGMUX2_GPIO216_S   16U
#define GPIO_GPGGMUX2_GPIO216_M   0x30000U      // Defines pin-muxing selection for GPIO216
#define GPIO_GPGGMUX2_GPIO217_S   18U
#define GPIO_GPGGMUX2_GPIO217_M   0xC0000U      // Defines pin-muxing selection for GPIO217
#define GPIO_GPGGMUX2_GPIO218_S   20U
#define GPIO_GPGGMUX2_GPIO218_M   0x300000U     // Defines pin-muxing selection for GPIO218
#define GPIO_GPGGMUX2_GPIO219_S   22U
#define GPIO_GPGGMUX2_GPIO219_M   0xC00000U     // Defines pin-muxing selection for GPIO219
#define GPIO_GPGGMUX2_GPIO220_S   24U
#define GPIO_GPGGMUX2_GPIO220_M   0x3000000U    // Defines pin-muxing selection for GPIO220
#define GPIO_GPGGMUX2_GPIO221_S   26U
#define GPIO_GPGGMUX2_GPIO221_M   0xC000000U    // Defines pin-muxing selection for GPIO221
#define GPIO_GPGGMUX2_GPIO222_S   28U
#define GPIO_GPGGMUX2_GPIO222_M   0x30000000U   // Defines pin-muxing selection for GPIO222
#define GPIO_GPGGMUX2_GPIO223_S   30U
#define GPIO_GPGGMUX2_GPIO223_M   0xC0000000U   // Defines pin-muxing selection for GPIO223

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCSEL1 register
//
//*************************************************************************************************
#define GPIO_GPGCSEL1_GPIO198_S   24U
#define GPIO_GPGCSEL1_GPIO198_M   0xF000000U    // GPIO198 Controller CPU Select
#define GPIO_GPGCSEL1_GPIO199_S   28U
#define GPIO_GPGCSEL1_GPIO199_M   0xF0000000U   // GPIO199 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCSEL2 register
//
//*************************************************************************************************
#define GPIO_GPGCSEL2_GPIO200_S   0U
#define GPIO_GPGCSEL2_GPIO200_M   0xFU          // GPIO200 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO201_S   4U
#define GPIO_GPGCSEL2_GPIO201_M   0xF0U         // GPIO201 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO202_S   8U
#define GPIO_GPGCSEL2_GPIO202_M   0xF00U        // GPIO202 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO203_S   12U
#define GPIO_GPGCSEL2_GPIO203_M   0xF000U       // GPIO203 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO204_S   16U
#define GPIO_GPGCSEL2_GPIO204_M   0xF0000U      // GPIO204 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO205_S   20U
#define GPIO_GPGCSEL2_GPIO205_M   0xF00000U     // GPIO205 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO206_S   24U
#define GPIO_GPGCSEL2_GPIO206_M   0xF000000U    // GPIO206 Controller CPU Select
#define GPIO_GPGCSEL2_GPIO207_S   28U
#define GPIO_GPGCSEL2_GPIO207_M   0xF0000000U   // GPIO207 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCSEL3 register
//
//*************************************************************************************************
#define GPIO_GPGCSEL3_GPIO208_S   0U
#define GPIO_GPGCSEL3_GPIO208_M   0xFU          // GPIO208 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO209_S   4U
#define GPIO_GPGCSEL3_GPIO209_M   0xF0U         // GPIO209 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO210_S   8U
#define GPIO_GPGCSEL3_GPIO210_M   0xF00U        // GPIO210 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO211_S   12U
#define GPIO_GPGCSEL3_GPIO211_M   0xF000U       // GPIO211 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO212_S   16U
#define GPIO_GPGCSEL3_GPIO212_M   0xF0000U      // GPIO212 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO213_S   20U
#define GPIO_GPGCSEL3_GPIO213_M   0xF00000U     // GPIO213 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO214_S   24U
#define GPIO_GPGCSEL3_GPIO214_M   0xF000000U    // GPIO214 Controller CPU Select
#define GPIO_GPGCSEL3_GPIO215_S   28U
#define GPIO_GPGCSEL3_GPIO215_M   0xF0000000U   // GPIO215 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCSEL4 register
//
//*************************************************************************************************
#define GPIO_GPGCSEL4_GPIO216_S   0U
#define GPIO_GPGCSEL4_GPIO216_M   0xFU          // GPIO216 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO217_S   4U
#define GPIO_GPGCSEL4_GPIO217_M   0xF0U         // GPIO217 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO218_S   8U
#define GPIO_GPGCSEL4_GPIO218_M   0xF00U        // GPIO218 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO219_S   12U
#define GPIO_GPGCSEL4_GPIO219_M   0xF000U       // GPIO219 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO220_S   16U
#define GPIO_GPGCSEL4_GPIO220_M   0xF0000U      // GPIO220 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO221_S   20U
#define GPIO_GPGCSEL4_GPIO221_M   0xF00000U     // GPIO221 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO222_S   24U
#define GPIO_GPGCSEL4_GPIO222_M   0xF000000U    // GPIO222 Controller CPU Select
#define GPIO_GPGCSEL4_GPIO223_S   28U
#define GPIO_GPGCSEL4_GPIO223_M   0xF0000000U   // GPIO223 Controller CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGLOCK register
//
//*************************************************************************************************
#define GPIO_GPGLOCK_GPIO198   0x40U         // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO199   0x80U         // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO200   0x100U        // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO201   0x200U        // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO202   0x400U        // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO203   0x800U        // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO204   0x1000U       // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO205   0x2000U       // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO206   0x4000U       // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO207   0x8000U       // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO208   0x10000U      // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO209   0x20000U      // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO210   0x40000U      // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO211   0x80000U      // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO212   0x100000U     // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO213   0x200000U     // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO214   0x400000U     // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO215   0x800000U     // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO216   0x1000000U    // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO217   0x2000000U    // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO218   0x4000000U    // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO219   0x8000000U    // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO220   0x10000000U   // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO221   0x20000000U   // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO222   0x40000000U   // Configuration Lock bit for this pin
#define GPIO_GPGLOCK_GPIO223   0x80000000U   // Configuration Lock bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPGCR register
//
//*************************************************************************************************
#define GPIO_GPGCR_GPIO198   0x40U         // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO199   0x80U         // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO200   0x100U        // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO201   0x200U        // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO202   0x400U        // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO203   0x800U        // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO204   0x1000U       // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO205   0x2000U       // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO206   0x4000U       // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO207   0x8000U       // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO208   0x10000U      // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO209   0x20000U      // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO210   0x40000U      // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO211   0x80000U      // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO212   0x100000U     // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO213   0x200000U     // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO214   0x400000U     // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO215   0x800000U     // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO216   0x1000000U    // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO217   0x2000000U    // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO218   0x4000000U    // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO219   0x8000000U    // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO220   0x10000000U   // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO221   0x20000000U   // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO222   0x40000000U   // Configuration lock commit bit for this pin
#define GPIO_GPGCR_GPIO223   0x80000000U   // Configuration lock commit bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHCTRL register
//
//*************************************************************************************************
#define GPIO_GPHCTRL_QUALPRD0_S   0U
#define GPIO_GPHCTRL_QUALPRD0_M   0xFFU       // Qualification sampling period for GPIO224 to
                                              // GPIO231
#define GPIO_GPHCTRL_QUALPRD1_S   8U
#define GPIO_GPHCTRL_QUALPRD1_M   0xFF00U     // Qualification sampling period for GPIO232 to
                                              // GPIO239
#define GPIO_GPHCTRL_QUALPRD2_S   16U
#define GPIO_GPHCTRL_QUALPRD2_M   0xFF0000U   // Qualification sampling period for GPIO240 to
                                              // GPIO247

